sparkfun/Arduino_Apollo3/boards.txt
# Copyright (c) 2019 SparkFun Electronics

# Permission is hereby granted, free of charge, to any person obtaining a copy
# of this software and associated documentation files (the "Software"), to deal
# in the Software without restriction, including without limitation the rights
# to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
# copies of the Software, and to permit persons to whom the Software is
# furnished to do so, subject to the following conditions:

# The above copyright notice and this permission notice shall be included in all
# copies or substantial portions of the Software.

# THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
# IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
# FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
# AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
# LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
# OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
# SOFTWARE.

# Menu Options
menu.loader=Bootloader
menu.svl_baud=SVL Baud Rate
menu.sbl_baud=Ambiq Secure Bootloader Baud Rate



###############################################################

artemis.name=SparkFun Artemis Module
artemis.build.variant=SparkFun_Artemis
artemis.build.board=SFE_ARTEMIS
artemis.upload.maximum_size=960000
artemis.upload.sbl_baud=115200
artemis.build.arch=APOLLO3
artemis.build.mcu=cortex-m4
artemis.build.f_cpu=48000000L
artemis.build.core=arduino
artemis.build.extra_flags=-DPART_apollo3 -DAM_PACKAGE_BGA -DAM_PART_APOLLO3 
artemis.build.includes=-I{build.variant.path}/config
artemis.build.preferred_export_format=axf
artemis.build.defs=
artemis.build.libs=
artemis.menu.svl_baud.921600=921600
artemis.menu.svl_baud.460800=460800
artemis.menu.svl_baud.230400=230400
artemis.menu.svl_baud.115200=115200
artemis.menu.svl_baud.57600=57600
artemis.menu.loader.sparkfun_svl=SparkFun Variable Loader (Recommended)
artemis.menu.loader.ambiq_sbl=Ambiq Secure Bootloader (Advanced)

artemis.menu.svl_baud.57600.upload.svl_baud=57600
artemis.menu.svl_baud.115200.upload.svl_baud=115200
artemis.menu.svl_baud.230400.upload.svl_baud=230400
artemis.menu.svl_baud.460800.upload.svl_baud=460800
artemis.menu.svl_baud.921600.upload.svl_baud=921600

artemis.menu.loader.ambiq_sbl.upload.tool=ambiq_bin2board
artemis.menu.loader.ambiq_sbl.build.ldscript={build.variant.path}/linker_scripts/gcc/ambiq_sbl_app.ld

artemis.menu.loader.sparkfun_svl.upload.tool=artemis_svl
artemis.menu.loader.sparkfun_svl.build.ldscript={build.variant.path}/linker_scripts/gcc/artemis_sbl_svl_app.ld


###############################################################

amap3redboard.name=SparkFun RedBoard Artemis
amap3redboard.build.variant=SparkFun_RedBoard_Artemis
amap3redboard.build.board=AM_AP3_SFE_BB_ARTEMIS
amap3redboard.upload.maximum_size=960000
amap3redboard.upload.sbl_baud=115200
amap3redboard.build.arch=APOLLO3
amap3redboard.build.mcu=cortex-m4
amap3redboard.build.f_cpu=48000000L
amap3redboard.build.core=arduino
amap3redboard.build.includes=-I{build.variant.path}/config
amap3redboard.build.ldscript={build.variant.path}/linker_scripts/gcc/artemis_sbl_svl_app.ld
amap3redboard.build.extra_flags=-DPART_apollo3 -DAM_PACKAGE_BGA -DAM_PART_APOLLO3 
amap3redboard.build.preferred_export_format=axf
amap3redboard.build.defs=
amap3redboard.build.libs=
amap3redboard.menu.svl_baud.921600=921600
amap3redboard.menu.svl_baud.460800=460800
amap3redboard.menu.svl_baud.230400=230400
amap3redboard.menu.svl_baud.115200=115200
amap3redboard.menu.svl_baud.57600=57600
amap3redboard.menu.loader.sparkfun_svl=SparkFun Variable Loader (Recommended)
amap3redboard.menu.loader.ambiq_sbl=Ambiq Secure Bootloader (Advanced)

amap3redboard.menu.svl_baud.57600.upload.svl_baud=57600
amap3redboard.menu.svl_baud.115200.upload.svl_baud=115200
amap3redboard.menu.svl_baud.230400.upload.svl_baud=230400
amap3redboard.menu.svl_baud.460800.upload.svl_baud=460800
amap3redboard.menu.svl_baud.921600.upload.svl_baud=921600

amap3redboard.menu.loader.ambiq_sbl.upload.tool=ambiq_bin2board
amap3redboard.menu.loader.ambiq_sbl.build.ldscript={build.variant.path}/linker_scripts/gcc/ambiq_sbl_app.ld

amap3redboard.menu.loader.sparkfun_svl.upload.tool=artemis_svl
amap3redboard.menu.loader.sparkfun_svl.build.ldscript={build.variant.path}/linker_scripts/gcc/artemis_sbl_svl_app.ld

###############################################################

amap3nano.name=SparkFun RedBoard Artemis Nano
amap3nano.build.variant=SparkFun_RedBoard_Artemis_Nano
amap3nano.build.board=AM_AP3_SFE_BB_ARTEMIS_NANO
amap3nano.upload.maximum_size=960000
amap3nano.upload.sbl_baud=115200
amap3nano.build.arch=APOLLO3
amap3nano.build.mcu=cortex-m4
amap3nano.build.f_cpu=48000000L
amap3nano.build.core=arduino
amap3nano.build.includes=-I{build.variant.path}/config
amap3nano.build.ldscript={build.variant.path}/linker_scripts/gcc/artemis_sbl_svl_app.ld
amap3nano.build.extra_flags=-DPART_apollo3 -DAM_PACKAGE_BGA -DAM_PART_APOLLO3
amap3nano.build.preferred_export_format=axf
amap3nano.build.defs=
amap3nano.build.libs=
amap3nano.menu.svl_baud.921600=921600
amap3nano.menu.svl_baud.460800=460800
amap3nano.menu.svl_baud.230400=230400
amap3nano.menu.svl_baud.115200=115200
amap3nano.menu.svl_baud.57600=57600
amap3nano.menu.loader.sparkfun_svl=SparkFun Variable Loader (Recommended)
amap3nano.menu.loader.ambiq_sbl=Ambiq Secure Bootloader (Advanced)

amap3nano.menu.svl_baud.57600.upload.svl_baud=57600
amap3nano.menu.svl_baud.115200.upload.svl_baud=115200
amap3nano.menu.svl_baud.230400.upload.svl_baud=230400
amap3nano.menu.svl_baud.460800.upload.svl_baud=460800
amap3nano.menu.svl_baud.921600.upload.svl_baud=921600

amap3nano.menu.loader.ambiq_sbl.upload.tool=ambiq_bin2board
amap3nano.menu.loader.ambiq_sbl.build.ldscript={build.variant.path}/linker_scripts/gcc/ambiq_sbl_app.ld

amap3nano.menu.loader.sparkfun_svl.upload.tool=artemis_svl
amap3nano.menu.loader.sparkfun_svl.build.ldscript={build.variant.path}/linker_scripts/gcc/artemis_sbl_svl_app.ld

###############################################################

amap3atp.name=SparkFun RedBoard Artemis ATP
amap3atp.build.variant=SparkFun_RedBoard_Artemis_ATP
amap3atp.build.board=AM_AP3_SFE_BB_ARTEMIS_ATP
amap3atp.upload.maximum_size=960000
amap3atp.upload.sbl_baud=115200
amap3atp.build.arch=APOLLO3
amap3atp.build.mcu=cortex-m4
amap3atp.build.f_cpu=48000000L
amap3atp.build.core=arduino
amap3atp.build.includes=-I{build.variant.path}/config
amap3atp.build.extra_flags=-DPART_apollo3 -DAM_PACKAGE_BGA -DAM_PART_APOLLO3 
amap3atp.build.ldscript={build.variant.path}/linker_scripts/gcc/artemis_sbl_svl_app.ld
amap3atp.build.preferred_export_format=axf
amap3atp.build.defs=
amap3atp.build.libs=
amap3atp.menu.svl_baud.921600=921600
amap3atp.menu.svl_baud.460800=460800
amap3atp.menu.svl_baud.230400=230400
amap3atp.menu.svl_baud.115200=115200
amap3atp.menu.svl_baud.57600=57600
amap3atp.menu.loader.sparkfun_svl=SparkFun Variable Loader (Recommended)
amap3atp.menu.loader.ambiq_sbl=Ambiq Secure Bootloader (Advanced)

amap3atp.menu.svl_baud.57600.upload.svl_baud=57600
amap3atp.menu.svl_baud.115200.upload.svl_baud=115200
amap3atp.menu.svl_baud.230400.upload.svl_baud=230400
amap3atp.menu.svl_baud.460800.upload.svl_baud=460800
amap3atp.menu.svl_baud.921600.upload.svl_baud=921600

amap3atp.menu.loader.ambiq_sbl.upload.tool=ambiq_bin2board
amap3atp.menu.loader.ambiq_sbl.build.ldscript={build.variant.path}/linker_scripts/gcc/ambiq_sbl_app.ld

amap3atp.menu.loader.sparkfun_svl.upload.tool=artemis_svl
amap3atp.menu.loader.sparkfun_svl.build.ldscript={build.variant.path}/linker_scripts/gcc/artemis_sbl_svl_app.ld

###############################################################

amap3thing.name=SparkFun Artemis Thing Plus
amap3thing.build.variant=SparkFun_Artemis_Thing_Plus
amap3thing.build.board=AM_AP3_SFE_THING_PLUS
amap3thing.upload.maximum_size=960000
amap3thing.upload.sbl_baud=115200
amap3thing.build.arch=APOLLO3
amap3thing.build.mcu=cortex-m4
amap3thing.build.f_cpu=48000000L
amap3thing.build.core=arduino
amap3thing.build.includes=-I{build.variant.path}/config
amap3thing.build.ldscript={build.variant.path}/linker_scripts/gcc/artemis_sbl_svl_app.ld
amap3thing.build.extra_flags=-DPART_apollo3 -DAM_PACKAGE_BGA -DAM_PART_APOLLO3
amap3thing.build.preferred_export_format=axf
amap3thing.build.defs=
amap3thing.build.libs=
amap3thing.menu.svl_baud.921600=921600
amap3thing.menu.svl_baud.460800=460800
amap3thing.menu.svl_baud.230400=230400
amap3thing.menu.svl_baud.115200=115200
amap3thing.menu.svl_baud.57600=57600
amap3thing.menu.loader.sparkfun_svl=SparkFun Variable Loader (Recommended)
amap3thing.menu.loader.ambiq_sbl=Ambiq Secure Bootloader (Advanced)

amap3thing.menu.svl_baud.57600.upload.svl_baud=57600
amap3thing.menu.svl_baud.115200.upload.svl_baud=115200
amap3thing.menu.svl_baud.230400.upload.svl_baud=230400
amap3thing.menu.svl_baud.460800.upload.svl_baud=460800
amap3thing.menu.svl_baud.921600.upload.svl_baud=921600

amap3thing.menu.loader.ambiq_sbl.upload.tool=ambiq_bin2board
amap3thing.menu.loader.ambiq_sbl.build.ldscript={build.variant.path}/linker_scripts/gcc/ambiq_sbl_app.ld

amap3thing.menu.loader.sparkfun_svl.upload.tool=artemis_svl
amap3thing.menu.loader.sparkfun_svl.build.ldscript={build.variant.path}/linker_scripts/gcc/artemis_sbl_svl_app.ld

###############################################################

edge.name=SparkFun Edge
edge.build.variant=SparkFun_Edge
edge.build.board=SFE_EDGE
edge.upload.tool=ambiq_bin2board
edge.upload.maximum_size=960000
edge.build.arch=APOLLO3
edge.build.mcu=cortex-m4
edge.build.f_cpu=48000000L
edge.build.core=arduino
edge.build.defs=
edge.build.includes=-I{build.variant.path}/config
edge.build.libs=
edge.build.extra_flags=-DPART_apollo3 -DAM_PACKAGE_BGA -DAM_PART_APOLLO3 
edge.build.ldscript={build.variant.path}/linker_scripts/gcc/ambiq_sbl_app.ld
edge.build.preferred_export_format=axf

edge.menu.sbl_baud.921600=921600 (Default)
edge.menu.sbl_baud.115200=115200 (TensorFlow Conference Versions)

edge.menu.svl_baud.921600=921600
edge.menu.svl_baud.460800=460800
edge.menu.svl_baud.230400=230400
edge.menu.svl_baud.115200=115200
edge.menu.svl_baud.57600=57600

edge.menu.loader.ambiq_sbl=Ambiq Secure Bootloader (Default)
edge.menu.loader.sparkfun_svl=SparkFun Variable Loader (Enable w/ Artemis Bootloader)

edge.menu.sbl_baud.115200.upload.sbl_baud=115200
edge.menu.sbl_baud.921600.upload.sbl_baud=921600

edge.menu.svl_baud.57600.upload.svl_baud=57600
edge.menu.svl_baud.115200.upload.svl_baud=115200
edge.menu.svl_baud.230400.upload.svl_baud=230400
edge.menu.svl_baud.460800.upload.svl_baud=460800
edge.menu.svl_baud.921600.upload.svl_baud=921600

edge.menu.loader.ambiq_sbl.upload.tool=ambiq_bin2board
edge.menu.loader.ambiq_sbl.build.ldscript={build.variant.path}/linker_scripts/gcc/ambiq_sbl_app.ld

edge.menu.loader.sparkfun_svl.upload.tool=artemis_svl
edge.menu.loader.sparkfun_svl.build.ldscript={build.variant.path}/linker_scripts/gcc/artemis_sbl_svl_app.ld



###############################################################

edge2.name=SparkFun Edge2
edge2.build.variant=SparkFun_Edge2
edge2.build.board=SFE_EDGE2
edge2.upload.maximum_size=960000
edge2.upload.sbl_baud=115200
edge2.build.arch=APOLLO3
edge2.build.mcu=cortex-m4
edge2.build.f_cpu=48000000L
edge2.build.core=arduino
edge2.build.includes=-I{build.variant.path}/config
edge2.build.extra_flags=-DPART_apollo3 -DAM_PACKAGE_BGA -DAM_PART_APOLLO3 
edge2.build.ldscript={build.variant.path}/linker_scripts/gcc/artemis_sbl_svl_app.ld
edge2.build.preferred_export_format=axf
edge2.build.defs=
edge2.build.libs=
edge2.menu.svl_baud.921600=921600
edge2.menu.svl_baud.460800=460800
edge2.menu.svl_baud.230400=230400
edge2.menu.svl_baud.115200=115200
edge2.menu.svl_baud.57600=57600
edge2.menu.loader.sparkfun_svl=SparkFun Variable Loader (Recommended)
edge2.menu.loader.ambiq_sbl=Ambiq Secure Bootloader (Advanced)

edge2.menu.svl_baud.57600.upload.svl_baud=57600
edge2.menu.svl_baud.115200.upload.svl_baud=115200
edge2.menu.svl_baud.230400.upload.svl_baud=230400
edge2.menu.svl_baud.460800.upload.svl_baud=460800
edge2.menu.svl_baud.921600.upload.svl_baud=921600

edge2.menu.loader.ambiq_sbl.upload.tool=ambiq_bin2board
edge2.menu.loader.ambiq_sbl.build.ldscript={build.variant.path}/linker_scripts/gcc/ambiq_sbl_app.ld

edge2.menu.loader.sparkfun_svl.upload.tool=artemis_svl
edge2.menu.loader.sparkfun_svl.build.ldscript={build.variant.path}/linker_scripts/gcc/artemis_sbl_svl_app.ld

###############################################################

